# SetRelativeDisplacement Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DisplacementElement..::..SetRelativeDisplacement Method
DisplacementElement Class See Also
---
Sets the relative displacement applied to the displaced elements by this DisplacementElement.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public void SetRelativeDisplacement(
	XYZ displacement
)
```

Visual Basic
---
```text
Public Sub SetRelativeDisplacement ( _
	displacement As XYZ _
)
```

Visual C++
---
```text
public:
void SetRelativeDisplacement(
	XYZ^ displacement
)
```

# ### Parameters
displacement
    Type: Autodesk.Revit.DB..::..XYZ The relative displacement.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
DisplacementElement Class
Autodesk.Revit.DB Namespace